#include <stdio.h>

int main()
{
	/* 스택 문제 */

	Problem2943();
	//Problem1874(); // 스택 수열
	//Problem10828(); // 스택 구현

	/* 백트래킹 문제 */
	/* 백트래킹 유의 점 */
	// 정렬이 필요한가? 중복된 결과를 걸러야 하는가?

	//Problem2580(); // 스도쿠 문제
	//Problem9663(); // N-Queen 문제
 	//Problem15665(); // N과 M(11) 백트래킹 기본 + 정렬 + 수열 중복출력 금지 + 인자 중복허용 + 사전순 정렬
	//Problem15664(); // N과 M(10) 백트래킹 기본 + 정렬 + 중복출력 금지 +오름차순
	//Problem15663(); // N과 M(9) 백트래킹 기본 + 정렬 + 중복출력 금지 
	//Problem15657(); // N과 M(8) 백트래킹 기본 + 정렬 + 중복허용 + 비내림차순
	//Problem15656(); // N과 M(7) 백트래킹 기본 + 정렬 + 중복허용
	//Problem15655(); // N과 M(6) 백트래킹 기본 + 정렬 + 오름차순
	//Problem15654(); // N과 M(5) 백트래킹 기본 + 정렬 
	//backtracking_Problem4(); // 15652번 백트래킹 기본 + 중복 허용 + 비내림차순
	//backtracking_Problem3(); // 15651번 백트래킹 기본 + 중복 허용
	//backtracking_Problem2(); // 15650번 백트래킹 기본 + 오름차순
	//backtracking_Problem1(); // 15649번 백트래킹 기본
}